<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.3.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Adobe Package Downloader.</string>
	<key>Identifier</key>
	<string>unity5.download.AdobePackageDownloader</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Adobe Package Downloader</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>https://tron-prod-customized-user-packages.s3.amazonaws.com/3280534b-57fe-4135-96a5-8af7fc64eb6f_MacOSDownloader?X-Amz-Security-Token=IQoJb3JpZ2luX2VjECgaCXVzLWVhc3QtMSJGMEQCID2TDsg45feYNNgT1K%2FhafxIHq%2FzX1r%2F5PHHoVJXGqnyAiBHkrQxovazIi6G0Fbrcj4rTsA3fXzhxJD%2FW8FfK%2FaIpSq8BQih%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAAaDDE2NzI1NTMyNjA0NSIMzAgcWCyyI4Xg5yfZKpAFg7YNrmvWc4HjuhtIMcr4ukcqpfyJqs%2FSKTiZ%2FoIUbp6VnpmBdryGSiKoCtvsXIQpcjeEmZWEvFO1D0Vv%2BlxQv5HWGlGtwVX4gLwDvb%2FVVCNrJW2kFx4Uz67bTrccTKoSggbWKSxSOHG%2B6MBZaMXtKqX2RxygRM8tflQGep2MOO3lLWqVFYPjqU04riPuFKQg26PqXxGwyGJz8WC2ScIC2POsOCIYqJqJGp5mDjtJ4E32UvAJHFEqI7AoCs%2FRQM8mGmHsAjne6K9wTqlvbi4%2Bue2tu2am%2FKEOz6S4vuvBgOBUHJUt7eZPhQhrh3NoyYJn0JfEQOnYA3O1dfYRMsk3AL8%2FimiJuLsIKRExTAb3cRsHYthoKM37gAVyBUOWOLYa1xKng%2BENoWyCm6DgjWMntkej%2BqDTsXqhafsgB6P6qqK49k0DLSuakjYvei9hRy%2BkCISFOZQvOYSqaIm%2BzC0WBWcFLjNTX6%2Bggbyp2wefBEt9kPAXzicQpJ9KvPGMIUnDMzXeQQ%2BnRYg7iwUeuRRIJqvSdSnL%2FQj%2BfvOTdBkI%2F%2BZIkp9E5ccXiVllXS3l2BbtsNh1%2BOxT0%2BVmq4vM1Oww%2Bgf56X09tPVHzQZbIUU3yNUk32%2Bw%2BAMHprRzrbKPM0c%2B53nnLI%2BbstRUB0ykhHCMTeb%2F6IU%2FBWQB8GK%2F2WirqJNuNkdI7NN9pkyguukjfI%2F83iZkZPDEWWZ%2BXXOeuKsrbyLU4VF5xWS%2F3dFI718aXsb1aYHhGNeFvuzMUWyq125KQ3uREwblV9TiDpudbIzkYGESI8%2FsCFkgIjMzcAqfP34qJ%2BaDb9C8PmYgd%2FuF7ZeNz0cRdw2B9ZaeqDauew7XcseWPdGDi5UYQ6ciNYoiquww0%2BrdvwY6sgHmaei4OYAFyovHqF%2BUeTMESqi54vHwv87sjxTS6PEwHpZk3AyvhM7XkSOGP2LLQ%2Fsz0CiY2D32eqY2JBmk4kX9LD3KDMtjeFI3QiRUjjj9mtPs93QVWlQN9010gO2BaLrhDlRSo9H0pXgVUL6d9w4so41idKIjPpj9d9m4MbfZvdCT85c07kXS5ZVmDhaTBpTWkLaHxgtF%2FTnUCM3wlTXTw2oCyFslGMmRuprCSxEgCXzc&amp;X-Amz-Algorithm=AWS4-HMAC-SHA256&amp;X-Amz-Date=20250410T082524Z&amp;X-Amz-SignedHeaders=host&amp;X-Amz-Expires=900&amp;X-Amz-Credential=ASIASN4JRXVOZ2JDVGVI%2F20250410%2Fus-east-1%2Fs3%2Faws4_request&amp;X-Amz-Signature=be240d7efddba5aa9469583f24da054de8423e0682b897572769df9dc6897532</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Adobe Package Downloader.app</string>
				<key>requirement</key>
				<string>anchor apple generic and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = JQ525L2MZD)</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/Adobe Package Downloader.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
