<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.3.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Adobe Package Downloader.</string>
	<key>Identifier</key>
	<string>unity5.download.AdobePackageDownloader</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Adobe Package Downloader</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>https://tron-prod-customized-user-packages.s3.amazonaws.com/5b52baa8-02aa-487a-a403-9408b6c707d9_MacOSDownloader?X-Amz-Security-Token=IQoJb3JpZ2luX2VjECoaCXVzLWVhc3QtMSJHMEUCIFD4IDqvYDYa9KlVwM7sXh7DorOeT%2BYRwnLpFu1THq57AiEAnuCOqGhW66ZEkjpwQiQqG0qTqxomx8vmitzq7CWtjUcqvAUIo%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgwxNjcyNTUzMjYwNDUiDE4BVaQL5idn6rlKqyqQBZhF5446lrvQ5Yp7f6d3bs7r3kTfJr%2F18QpTMvX8v026vN8vLk%2FP607pZzNPpwee%2BDLdcJq0funVboomLIT8vZBWGGqk8YozALF2C0q3y3x85COxPcXb15Ay8r%2FgPLfqZZzgiv9eXs%2Fhhbt%2BxYmdDrQJbmn1pT71KKX6PfQ0KqoiW4HGHAhb6gPQSuzeb5FkAV%2FdyHmHmpI1wPYnSugdzY%2FtpOHOwOcy6Nu2FC0PiYN8RzP8h%2Bzxc%2FwVvhw02cccf%2BAjU2ec5LXLo9c%2FaQkvgR57lO80S9zfbsvmNemxdyQVvDteElEYDLszYfUlKHLzgxbcuvx9kr1tUD0MQhzdpAvcnr2S8pCmRwrU8%2BQB49CCZu5053IluZVeHSkQX94fpHbRj2YfrLvf0jjzrSQHoI7MvWeRd480L6ylvpCDwf5cKNs3bjjjWxaf0LeMsIcSoNwnuBeQcIV%2FVeL6KBogr1%2BfT0ivadHrqgTy64fTiiahoQgau8evzXY1a4fPBjjeyhafB0Gtqy4tc1dJsmjWrjR1PumsjrlR6lR3LUmF56a0joNv21HLua0JirMML8ojVxKWR0bMxsknceKT9g6nCeMyGPBOzW0MMDraNbKrV8kXy3nIt4mr8R7LfTJO1Ik0FmSKXRdJOH29Ti%2FUeOIsE1fpcEBftXav1Ht%2F%2BC9c3ci9JwG8ZB%2FZ172lZWVPFW8PfHlvDOLl33ZVCSdJpvoo2K4cb7qOvvf0vJczX5CrR8GxEgdTCLNUjC3A4wgbOC2osqr%2Bj5XR6wnMkGA5lS3K8SA%2FSGrLTGNOucGTwS%2FHuOz72PtYRg3K0qNoUDztNAn9ySYS0HLm4i7QY3NbEKktMhxCP4vO8SJ1qV9iUCm%2BYHJiMLGg3r8GOrEBNyoYaUE1UK%2FBuM5luCawzirx2MX64%2B20v9Zk%2B31kdKfrGgSXrKtkixAO5dOU6v6gaHgXOAMnBcspclHn2Q7WKP3iE2UjH13r60OGDn7UxX8Uk4W%2BKCeCpTC9fmnd5LqNIgM35fjxND6yRKNhPqxdL%2FvuWZby%2BpfxHkymPfONWh8t3OhX9y%2BHTc6o%2Fv2CbFrxtKLIN4UszRMPyLr4N5FPQTy%2FfyXJK3EtWfqO8K22fZeJ&amp;X-Amz-Algorithm=AWS4-HMAC-SHA256&amp;X-Amz-Date=20250410T102053Z&amp;X-Amz-SignedHeaders=host&amp;X-Amz-Expires=900&amp;X-Amz-Credential=ASIASN4JRXVO5AAOQWM6%2F20250410%2Fus-east-1%2Fs3%2Faws4_request&amp;X-Amz-Signature=f5482db5bc5ab82f2b147993ee2aa5b0407f7e3c9a9b965d2aaafb3d59fad44c</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Adobe Package Downloader.app</string>
				<key>requirement</key>
				<string>anchor apple generic and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = JQ525L2MZD)</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/Adobe Package Downloader.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
