<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.3.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Adobe Package Downloader.</string>
	<key>Identifier</key>
	<string>unity5.download.AdobePackageDownloader</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Adobe Package Downloader</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>https://tron-prod-customized-user-packages.s3.amazonaws.com/3280534b-57fe-4135-96a5-8af7fc64eb6f_MacOSDownloader?X-Amz-Security-Token=IQoJb3JpZ2luX2VjEOD%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLWVhc3QtMSJIMEYCIQCoDeoP3iSvoccCS0Ikz%2Bs02cakIdnzaHfWGys78a0zugIhAKDFZ0A8KyAgCER4Uk3tfv9btdi%2BkQNMbDaaeOkU2rQkKrMFCFkQABoMMTY3MjU1MzI2MDQ1Igz3k5EbKRiYDyHQXQ8qkAW%2Bivf8CyCo537IMRe21wSgOzE9U4oBe8b5dGe1Y2OjKHmXwErE8xUC1y5pYuW9LPNbeQhTWI1wgoo%2Fh%2FDJIdCP9iElobHkakXwrG%2FleXvMQRur%2Bs%2Fz%2BU1rrgBVuw%2Btr%2F%2BxXHMDtSSPltAKlxDKm6uzGrHjRC2qCQZtMlighoOeoH2VixF3oZeohAl%2FEgGVrXpRBtIG98fHF4FzwBGmdVl1QQH%2BmwPbUs2ae190QJ3xC4DuS2NQq6o68cKoUY4sR2cjlk0ypmdTJl3cT%2FSLlwZeYAiTikhlfTdUH%2Bbde18veZP31QVyx%2F7p7auAOxD0b1Hqxk%2Fkx%2BwK9ituOIVVhLr6%2BS3TaHXr3rQ3%2BT3mVk33ddK5d3I2tGXQF5x1E3Qgh0o76v3MfrvA2%2FBKj3SHrShbjlvndgr2UP7FL1uIw5Qq0bbF3xXsfAmdPaitQyREgIea1HPsucNaEOT4JLUuJoiemUIYyx1h0sKhSdlWFpHXLkP9X3m%2B6omm%2BfVx7iIajx%2BXTcZ6YrICmqEjrdUmys0cyH%2FEH%2FWhj7W3h93jXQooP3Zjqdk9d%2F011qjlAdGYHp89voF%2FXMEwF%2BxaQXK2P20hvyFJhVME00ViYnXrCtYmyXDLPwcbSwSGaNxn5BJ9XAs%2FnEXLmIbyrnfIgRt6FMy09UwYN9pjAyFa9aG2KQ%2BiSJGbprVnpXwSK%2BVybFAreTiM%2BXfqF9XKIiCCoBBMS2ESYteKMN9OGC8GYu818nAEnu1%2Fd%2BAa5j6A%2F0jAWQssE4og4tPL3JCp5FjO8kcB3lcEX%2BVtpWLDs0wU8Z29NGvVfKEk%2BD4LEs8iW9wZ2Kd0MXw6T%2B97xhxMK6BoA3mmzYEe3HkZaPvvJOFQfUKoxewnYDDXjc6%2FBjqwAeTqqV74QOjubFak5RFUSQEaSekNcS0WCFSLB%2FXDpdMXbTdNP31D18Ye0fhiZhIl%2BytlkdVkNDC7WMTf9P9OGtRjgUdIe4d5HkQ3pS%2Bjc0OL5VnP9bCA00LiLM4oyrubA9nrI4NGVK8RSot%2FSXUnF1zSm0Sb8HYTLKYGeAZzLCa8okVvbAHwyuJtiG0e5dBwQ%2Bwx5tpIBW4iYcgkgFwQO3ph%2FXcBXBTBtRKeUlQQAGc9&amp;X-Amz-Algorithm=AWS4-HMAC-SHA256&amp;X-Amz-Date=20250407T095351Z&amp;X-Amz-SignedHeaders=host&amp;X-Amz-Expires=899&amp;X-Amz-Credential=ASIASN4JRXVO4J42AYN5%2F20250407%2Fus-east-1%2Fs3%2Faws4_request&amp;X-Amz-Signature=ef3c2bc4c9f5c124caaee813e8b361102d90621b7273fe502f3a4252a4c47b53</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Adobe Package Downloader.app</string>
				<key>requirement</key>
				<string>anchor apple generic and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = JQ525L2MZD)</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/Adobe Package Downloader.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
